In [1]:
import kaggle

In [ ]:
!kaggle datasets download najir0123/walmart-10k-sales-datasets -f Walmart.csv

In [2]:
import pandas as pd

In [3]:
from warnings import filterwarnings
filterwarnings('ignore')

# Data Exploration & Loading

In [4]:
df=pd.read_csv('Walmart.csv')
df

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,$15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,$46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,$58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,$86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48
...,...,...,...,...,...,...,...,...,...,...,...
10046,9996,WALM056,Rowlett,Fashion accessories,$37,3.0,03/08/23,10:10:00,Cash,3.0,0.33
10047,9997,WALM030,Richardson,Home and lifestyle,$58,2.0,22/02/21,14:20:00,Cash,7.0,0.48
10048,9998,WALM050,Victoria,Fashion accessories,$52,3.0,15/06/23,16:00:00,Credit card,4.0,0.48
10049,9999,WALM032,Tyler,Home and lifestyle,$79,2.0,25/02/21,12:25:00,Cash,7.0,0.48
10050,10000,WALM069,Rockwall,Fashion accessories,$62,3.0,26/09/20,9:48:00,Cash,3.0,0.33

In [5]:
df.shape

(10051, 11)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10051 entries, 0 to 10050
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10051 non-null  int64
 1   Branch          10051 non-null  object
 2   City            10051 non-null  object
 3   category        10051 non-null  object
 4   unit_price      10020 non-null  object
 5   quantity        10020 non-null  float64
 6   date            10051 non-null  object
 7   time            10051 non-null  object
 8   payment_method  10051 non-null  object
 9   rating          10051 non-null  float64
 10  profit_margin   10051 non-null  float64
dtypes: float64(3), int64(1), object(7)
memory usage: 863.9+ KB

In [7]:
df.dtypes

invoice_id          int64
Branch             object
City               object
category           object
unit_price         object
quantity          float64
date               object
time               object
payment_method     object
rating            float64
profit_margin     float64
dtype: object

# Data Cleaning

In [8]:
df.duplicated().sum()

51

In [9]:
df.drop_duplicates(inplace=True)

In [10]:
df.duplicated().sum()

0

In [11]:
df.isnull().sum()

invoice_id         0
Branch             0
City               0
category           0
unit_price        31
quantity          31
date               0
time               0
payment_method     0
rating             0
profit_margin      0
dtype: int64

In [12]:
df.dropna(inplace=True)

In [13]:
df.isnull().sum()

invoice_id        0
Branch            0
City              0
category          0
unit_price        0
quantity          0
date              0
time              0
payment_method    0
rating            0
profit_margin     0
dtype: int64

In [14]:
#Remove "$" from unit price

In [15]:
df['unit_price']= df['unit_price'].str.replace('$','').astype(float)

In [16]:
df['unit_price']

0       74.69
1       15.28
2       46.33
3       58.22
4       86.31
        ...
9995    37.00
9996    58.00
9997    52.00
9998    79.00
9999    62.00
Name: unit_price, Length: 9969, dtype: float64

In [17]:
df['date']=pd.to_datetime(df['date'])

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9969 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      9969 non-null   int64
 1   Branch          9969 non-null   object
 2   City            9969 non-null   object
 3   category        9969 non-null   object
 4   unit_price      9969 non-null   float64
 5   quantity        9969 non-null   float64
 6   date            9969 non-null   datetime64[ns]
 7   time            9969 non-null   object
 8   payment_method  9969 non-null   object
 9   rating          9969 non-null   float64
 10  profit_margin   9969 non-null   float64
dtypes: datetime64[ns](1), float64(4), int64(1), object(5)
memory usage: 934.6+ KB

In [19]:
df.columns

Index(['invoice_id', 'Branch', 'City', 'category', 'unit_price', 'quantity',
       'date', 'time', 'payment_method', 'rating', 'profit_margin'],
      dtype='object')

# Feature Engineering

In [20]:
# Total Sales
df['Total Sales']=df['unit_price']*df['quantity']

In [21]:
# Profit
df['Profit'] = df['profit_margin'] * df['Total Sales']

In [22]:
#Date-based Features
df['day'] = df['date'].dt.day
df['month'] = df['date'].dt.month
df['year'] = df['date'].dt.year

In [23]:
#Rename columns
df.rename(columns={'invoice_id':'Invoice_id',
                    'category':'Category',
                   'unit_price':'Unit_price',
                   'quantity':'Quantity',
                   'date':'Date',
                   'time':'Time',
                   'payment_method':'Payment_method',
                   'rating':'Rating',
                   'profit_margin':'Profit_margin',
                   'Total Sales':'Total_sales',
                   'day':'Day',
                   'month':'Month',
                   'year':'Year'
                  },inplace=True)

In [24]:
df.columns

Index(['Invoice_id', 'Branch', 'City', 'Category', 'Unit_price', 'Quantity',
       'Date', 'Time', 'Payment_method', 'Rating', 'Profit_margin',
       'Total_sales', 'Profit', 'Day', 'Month', 'Year'],
      dtype='object')

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9969 entries, 0 to 9968
Data columns (total 16 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Invoice_id      9969 non-null   int64
 1   Branch          9969 non-null   object
 2   City            9969 non-null   object
 3   Category        9969 non-null   object
 4   Unit_price      9969 non-null   float64
 5   Quantity        9969 non-null   float64
 6   Date            9969 non-null   object
 7   Time            9969 non-null   object
 8   Payment_method  9969 non-null   object
 9   Rating          9969 non-null   float64
 10  Profit_margin   9969 non-null   float64
 11  Total_sales     9969 non-null   float64
 12  Profit          9969 non-null   float64
 13  Day             9969 non-null   int64
 14  Month           9969 non-null   int64
 15  Year            9969 non-null   int64
dtypes: float64(6), int64(4), object(6)
memory usage: 1.2+ MB

In [25]:
df.head(4)

,Invoice_id,Branch,City,Category,Unit_price,Quantity,Date,Time,Payment_method,Rating,Profit_margin,Total_sales,Profit,Day,Month,Year
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,2019-05-01,13:08:00,Ewallet,9.1,0.48,522.83,250.9584,1,5,2019
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,2019-08-03,10:29:00,Cash,9.6,0.48,76.40,36.6720,3,8,2019
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,2019-03-03,13:23:00,Credit card,7.4,0.33,324.31,107.0223,3,3,2019
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,2019-01-27,20:33:00,Ewallet,8.4,0.33,465.76,153.7008,27,1,2019

# Saving the clean file

In [26]:
# Save cleaned data as csv 
df.to_csv("Walmart_sales.csv", index=False)

# Connecting to MySQL

In [31]:
import pymysql

In [43]:
conn = pymysql.connect(
    host="localhost",  
    user="root",
    password="Rutuja@2024",
    database="waldb"      
)


cursor = conn.cursor()
print("Connected to MySQL successfully!")

Connected to MySQL successfully!

In [45]:
create_table_query = """
CREATE TABLE IF NOT EXISTS Walmart_sales (
    Invoice_id BIGINT PRIMARY KEY,
    Branch VARCHAR(10),
    City VARCHAR(50),
    Category VARCHAR(50),
    Unit_price FLOAT,
    Quantity FLOAT,
    Date DATE, 
    Time VARCHAR(20),
    Payment_method VARCHAR(20),
    Rating FLOAT,
    Profit_margin FLOAT,
    Total_sales FLOAT,
    Profit FLOAT,
    Day INT,
    Month INT,
    Year INT
);
"""

cursor.execute(create_table_query)
print("Table created successfully!")

Table created successfully!

In [46]:
for _, row in df.iterrows():
    insert_query = """
    INSERT INTO Walmart_sales (Invoice_id, Branch, City, Category, Unit_price, Quantity, Date, Time, Payment_method, Rating, Profit_margin, Total_sales, Profit, Day, Month, Year)
    VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s);
    """
    values = tuple(row)  
    cursor.execute(insert_query, values)

conn.commit()
print("Data successfully inserted into MySQL!")

Data successfully inserted into MySQL!

In [48]:
cursor.execute('select* from Walmart_sales')

9969

In [49]:
cursor.close()
conn.close()